In [59]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [60]:
pd.__version__,  np.__version__

('2.2.0', '1.26.4')

In [61]:
s = pd.Series([10,20,30,40,50], index=['A','B','C','D','E'])
s

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [62]:
type(s)

pandas.core.series.Series

In [63]:
s.size

5

In [64]:
print(s)
s[2:4]

A    10
B    20
C    30
D    40
E    50
dtype: int64

C    30
D    40
dtype: int64

In [65]:
d = {'a':10, 'b':20, 'c':30, 'd':40}
s1 = pd.Series(d)
print(s1)

a    10
b    20
c    30
d    40
dtype: int64

In [66]:
s2 = pd.Series(s1, index=['a','b','d','e'])
s2

a    10.0
b    20.0
d    40.0
e     NaN
dtype: float64

In [67]:
s2[1:3]

b    20.0
d    40.0
dtype: float64

In [68]:
t = (('a',1,2),('b',2), ('c',3), ('d',4) ,('e',5), ('f',6), ('g',7))
st = pd.Series(t)
st

0    (a, 1, 2)
1       (b, 2)
2       (c, 3)
3       (d, 4)
4       (e, 5)
5       (f, 6)
6       (g, 7)
dtype: object

In [69]:
dt = np.arange(1,100,10)
ds = pd.Series(dt, index=np.arange(1,100,10))
ds

1      1
11    11
21    21
31    31
41    41
51    51
61    61
71    71
81    81
91    91
dtype: int32

In [70]:
df ={
    'Name':["Nitin","Shailesh","Adhik"],
    'Age':[37,34,33],
    'Sex':['M','M','M']
}
sdf = pd.Series(df)
sdf

Name    [Nitin, Shailesh, Adhik]
Age                 [37, 34, 33]
Sex                    [M, M, M]
dtype: object

In [71]:
ndf = pd.DataFrame(df, index=['A','B','C'])
ndf

       Name  Age Sex
A     Nitin   37   M
B  Shailesh   34   M
C     Adhik   33   M

In [73]:
d = {

    'Name':["Nitin","Shailesh","Adhik"],
    'Age':[37,34,33],
    'Sex':['M','M','M']
}


s = pd.DataFrame(d, index=['A','B','C'])
s

       Name  Age Sex
A     Nitin   37   M
B  Shailesh   34   M
C     Adhik   33   M

In [78]:
s1=pd.DataFrame(d, columns=['A','B','C'], index=[0,1,2])
s1

     A    B    C
0  NaN  NaN  NaN
1  NaN  NaN  NaN
2  NaN  NaN  NaN

In [84]:
t = (('A',10,'4th'),('B', 11, '5th'),('C',12,'6th'),('D',13,'7th'))
df = pd.DataFrame(t, index=['A','B','C','D'], columns=['Name','Age','Position'])
df

  Name  Age Position
A    A   10      4th
B    B   11      5th
C    C   12      6th
D    D   13      7th

In [92]:
df = pd.DataFrame(t, index=[0,1,2,3], columns=['A','B','C'])
df

   A   B    C
0  A  10  4th
1  B  11  5th
2  C  12  6th
3  D  13  7th

In [94]:
df.loc[[0,3]]

   A   B    C
0  A  10  4th
3  D  13  7th

In [96]:
df.loc[3]

A      D
B     13
C    7th
Name: 3, dtype: object

In [102]:
data = {

    "calaries" : [410, 520 ,390, 440, 750, 960],
    "duration" : [30, 60, 70, 70, 90, 40]
}

data

{'calaries': [410, 520, 390, 440, 750, 960],
 'duration': [30, 60, 70, 70, 90, 40]}

In [104]:
df = pd.DataFrame(data, index=['D1', 'D2', 'D3', 'D4', 'D5', 'D6'])
df

    calaries  duration
D1       410        30
D2       520        60
D3       390        70
D4       440        70
D5       750        90
D6       960        40

In [105]:
df.loc[['D1','D5']]

    calaries  duration
D1       410        30
D5       750        90

In [108]:
df[['duration','calaries']]

    duration  calaries
D1        30       410
D2        60       520
D3        70       390
D4        70       440
D5        90       750
D6        40       960

In [109]:
df.calaries

D1    410
D2    520
D3    390
D4    440
D5    750
D6    960
Name: calaries, dtype: int64

In [110]:
df.duration

D1    30
D2    60
D3    70
D4    70
D5    90
D6    40
Name: duration, dtype: int64

In [112]:
df['calaries'].mean()

578.3333333333334

In [114]:
df.describe()

         calaries   duration
count    6.000000   6.000000
mean   578.333333  60.000000
std    228.684645  21.908902
min    390.000000  30.000000
25%    417.500000  45.000000
50%    480.000000  65.000000
75%    692.500000  70.000000
max    960.000000  90.000000